fs = %w(
年度	整数
開設年度	整数
開設学期	コード
科目コード	コード
仮科目コード	コード
科目名	テキスト
サブタイトル	テキスト
科目名（カナ）	テキスト
科目名（英字）	テキスト
閉講年度	整数
閉講学期	整数
改訂年度	整数
改訂学期	整数
科目所属１	テキスト
科目所属２	テキスト
科目大区分コード	コード
科目大区分	テキスト
科目中区分	テキスト
科目小区分	テキスト
科目詳細区分	テキスト
授業分類	テキスト
卒業要件	テキスト
科目分類	テキスト
科目種類	テキスト
必選区分	テキスト
臨床実習科目フラグ	コード
単位数（した二つの合計値）	整数
放送授業（とみなす単位）	整数
面接授業（とみなす単位）	整数
科目領域	テキスト
科目分野	テキスト
備考	テキスト
科目等発送物の分類（科目・科目外）	テキスト
放送メディアコード	コード
放送メディア	テキスト
主任講師	テキスト
主任講師（肩書）	テキスト
現職名	テキスト
放送時間	テキスト
講義概要	テキスト
単位認定試験日	日付
単位認定試験・時限	テキスト
単位認定試験試験日・時限１	テキスト
単位認定試験試験日・時限２	テキスト
単位認定試験平均点１	整数
単位認定試験平均点２	整数
単位認定試験試験日・時限	テキスト
単位認定試験平均点	整数
授業の目標	テキスト
回(第1回)	テキスト	テーマ1	テキスト	内容1	テキスト	執筆担当講師名1	テキスト	執筆担当講師名（所属・職名）1	テキスト	放送担当講師名1	テキスト	放送担当講師名（所属・職名）1	テキスト
回(第2回)	テキスト	テーマ2	テキスト	内容2	テキスト	執筆担当講師名2	テキスト	執筆担当講師名（所属・職名）2	テキスト	放送担当講師名2	テキスト	放送担当講師名（所属・職名）2	テキスト
回(第3回)	テキスト	テーマ3	テキスト	内容3	テキスト	執筆担当講師名3	テキスト	執筆担当講師名（所属・職名）3	テキスト	放送担当講師名3	テキスト	放送担当講師名（所属・職名）3	テキスト
回(第4回)	テキスト	テーマ4	テキスト	内容4	テキスト	執筆担当講師名4	テキスト	執筆担当講師名（所属・職名）4	テキスト	放送担当講師名4	テキスト	放送担当講師名（所属・職名）4	テキスト
回(第5回)	テキスト	テーマ5	テキスト	内容5	テキスト	執筆担当講師名5	テキスト	執筆担当講師名（所属・職名）5	テキスト	放送担当講師名5	テキスト	放送担当講師名（所属・職名）5	テキスト
回(第6回)	テキスト	テーマ6	テキスト	内容6	テキスト	執筆担当講師名6	テキスト	執筆担当講師名（所属・職名）6	テキスト	放送担当講師名6	テキスト	放送担当講師名（所属・職名）6	テキスト
回(第7回)	テキスト	テーマ7	テキスト	内容7	テキスト	執筆担当講師名7	テキスト	執筆担当講師名（所属・職名）7	テキスト	放送担当講師名7	テキスト	放送担当講師名（所属・職名）7	テキスト
回(第8回)	テキスト	テーマ8	テキスト	内容8	テキスト	執筆担当講師名8	テキスト	執筆担当講師名（所属・職名）8	テキスト	放送担当講師名8	テキスト	放送担当講師名（所属・職名）8	テキスト
回(第9回)	テキスト	テーマ9	テキスト	内容9	テキスト	執筆担当講師名9	テキスト	執筆担当講師名（所属・職名）9	テキスト	放送担当講師名9	テキスト	放送担当講師名（所属・職名）9	テキスト
回(第10回)	テキスト	テーマ10	テキスト	内容10	テキスト	執筆担当講師名10	テキスト	執筆担当講師名（所属・職名）10	テキスト	放送担当講師名10	テキスト	放送担当講師名（所属・職名）10	テキスト
回(第11回)	テキスト	テーマ11	テキスト	内容11	テキスト	執筆担当講師名11	テキスト	執筆担当講師名（所属・職名）11	テキスト	放送担当講師名11	テキスト	放送担当講師名（所属・職名）11	テキスト
回(第12回)	テキスト	テーマ12	テキスト	内容12	テキスト	執筆担当講師名12	テキスト	執筆担当講師名（所属・職名）12	テキスト	放送担当講師名12	テキスト	放送担当講師名（所属・職名）12	テキスト
回(第13回)	テキスト	テーマ13	テキスト	内容13	テキスト	執筆担当講師名13	テキスト	執筆担当講師名（所属・職名）13	テキスト	放送担当講師名13	テキスト	放送担当講師名（所属・職名）13	テキスト
回(第14回)	テキスト	テーマ14	テキスト	内容14	テキスト	執筆担当講師名14	テキスト	執筆担当講師名（所属・職名）14	テキスト	放送担当講師名14	テキスト	放送担当講師名（所属・職名）14	テキスト
回(第15回)	テキスト	テーマ15	テキスト	内容15	テキスト	執筆担当講師名15	テキスト	執筆担当講師名（所属・職名）15	テキスト	放送担当講師名15	テキスト	放送担当講師名（所属・職名）15	テキスト
回(第16回)	テキスト	テーマ16	テキスト	内容16	テキスト	執筆担当講師名16	テキスト	執筆担当講師名（所属・職名）16	テキスト	放送担当講師名16	テキスト	放送担当講師名（所属・職名）16	テキスト
回(第17回)	テキスト	テーマ17	テキスト	内容17	テキスト	執筆担当講師名17	テキスト	執筆担当講師名（所属・職名）17	テキスト	放送担当講師名17	テキスト	放送担当講師名（所属・職名）17	テキスト
回(第18回)	テキスト	テーマ18	テキスト	内容18	テキスト	執筆担当講師名18	テキスト	執筆担当講師名（所属・職名）18	テキスト	放送担当講師名18	テキスト	放送担当講師名（所属・職名）18	テキスト
回(第19回)	テキスト	テーマ19	テキスト	内容19	テキスト	執筆担当講師名19	テキスト	執筆担当講師名（所属・職名）19	テキスト	放送担当講師名19	テキスト	放送担当講師名（所属・職名）19	テキスト
回(第20回)	テキスト	テーマ20	テキスト	内容20	テキスト	執筆担当講師名20	テキスト	執筆担当講師名（所属・職名）20	テキスト	放送担当講師名20	テキスト	放送担当講師名（所属・職名）20	テキスト
回(第21回)	テキスト	テーマ21	テキスト	内容21	テキスト	執筆担当講師名21	テキスト	執筆担当講師名（所属・職名）21	テキスト	放送担当講師名21	テキスト	放送担当講師名（所属・職名）21	テキスト
回(第22回)	テキスト	テーマ22	テキスト	内容22	テキスト	執筆担当講師名22	テキスト	執筆担当講師名（所属・職名）22	テキスト	放送担当講師名22	テキスト	放送担当講師名（所属・職名）22	テキスト
回(第23回)	テキスト	テーマ23	テキスト	内容23	テキスト	執筆担当講師名23	テキスト	執筆担当講師名（所属・職名）23	テキスト	放送担当講師名23	テキスト	放送担当講師名（所属・職名）23	テキスト
回(第24回)	テキスト	テーマ24	テキスト	内容24	テキスト	執筆担当講師名24	テキスト	執筆担当講師名（所属・職名）24	テキスト	放送担当講師名24	テキスト	放送担当講師名（所属・職名）24	テキスト
回(第25回)	テキスト	テーマ25	テキスト	内容25	テキスト	執筆担当講師名25	テキスト	執筆担当講師名（所属・職名）25	テキスト	放送担当講師名25	テキスト	放送担当講師名（所属・職名）25	テキスト
回(第26回)	テキスト	テーマ26	テキスト	内容26	テキスト	執筆担当講師名26	テキスト	執筆担当講師名（所属・職名）26	テキスト	放送担当講師名26	テキスト	放送担当講師名（所属・職名）26	テキスト
回(第27回)	テキスト	テーマ27	テキスト	内容27	テキスト	執筆担当講師名27	テキスト	執筆担当講師名（所属・職名）27	テキスト	放送担当講師名27	テキスト	放送担当講師名（所属・職名）27	テキスト
回(第28回)	テキスト	テーマ28	テキスト	内容28	テキスト	執筆担当講師名28	テキスト	執筆担当講師名（所属・職名）28	テキスト	放送担当講師名28	テキスト	放送担当講師名（所属・職名）28	テキスト
回(第29回)	テキスト	テーマ29	テキスト	内容29	テキスト	執筆担当講師名29	テキスト	執筆担当講師名（所属・職名）29	テキスト	放送担当講師名29	テキスト	放送担当講師名（所属・職名）29	テキスト
回(第30回)	テキスト	テーマ30	テキスト	内容30	テキスト	執筆担当講師名30	テキスト	執筆担当講師名（所属・職名）30	テキスト	放送担当講師名30	テキスト	放送担当講師名（所属・職名）30	テキスト
科目表示順	整数
表示	テキスト
学習テーマ１	テキスト
A1	テキスト
学習テーマ２	テキスト
A2	テキスト
学習テーマ３	テキスト
A3	テキスト
エキスパートプラン１	テキスト
B1	テキスト
エキスパートプラン２	テキスト
B2	テキスト
エキスパートプラン３	テキスト
B3	テキスト
エキスパートプラン４	テキスト
B4	テキスト
エキスパートプラン５	テキスト
B5	テキスト
エキスパートプラン６	テキスト
B6	テキスト
教員・看護師１	テキスト
C1	テキスト
教員・看護師２	テキスト
C2	テキスト
教員・看護師３	テキスト
C3	テキスト
教員・看護師４	テキスト
C4	テキスト
教員・看護師5	テキスト
C5	テキスト
タグ（検索用隠しフィールド）	テキスト
学期コード	コード
学期	整数
クラス	テキスト
センターコード	コード
センター名	テキスト
科目区分	コード
科目名カナ	テキスト
科目英文名	テキスト
定員	整数
第1回	テキスト
第2回	テキスト
第3回	テキスト
第4回	テキスト
第5回	テキスト
第6回	テキスト
第7回	テキスト
第8回	テキスト
講師氏名1	テキスト
講師氏名カナ1	テキスト
所属1	テキスト
講師経験フラグ1	コード
講師経験年1	整数
講師氏名2	テキスト
講師氏名カナ2	テキスト
所属2	テキスト
講師経験フラグ2	コード
講師経験年2	整数
講師氏名3	テキスト
講師氏名カナ3	テキスト
所属3	テキスト
講師経験フラグ3	コード
講師経験年3	整数
講師氏名4	テキスト
講師氏名カナ4	テキスト
所属4	テキスト
講師経験フラグ4	コード
講師経験年4	整数
講師氏名5	テキスト
講師氏名カナ5	テキスト
所属5	テキスト
講師経験フラグ5	コード
講師経験年5	整数
講師氏名6	テキスト
講師氏名カナ6	テキスト
所属6	テキスト
講師経験フラグ6	コード
講師経験年6	整数
講師氏名7	テキスト
講師氏名カナ7	テキスト
所属7	テキスト
講師経験フラグ7	コード
講師経験年7	整数
講師氏名8	テキスト
講師氏名カナ8	テキスト
所属8	テキスト
講師経験フラグ8	コード
講師経験年8	整数
講師氏名9	テキスト
講師氏名カナ9	テキスト
所属9	テキスト
講師経験フラグ9	コード
講師経験年9	整数
教科書	テキスト
教科書著者名1	テキスト
教科書書名1	テキスト
教科書出版社名1	テキスト
教科書定価1	テキスト
教科書ISBN1	テキスト
教科書備考1	テキスト
教科書著者名2	テキスト
教科書書名2	テキスト
教科書出版社名2	テキスト
教科書定価2	テキスト
教科書ISBN2	テキスト
教科書備考2	テキスト
教科書著者名3	テキスト
教科書書名3	テキスト
教科書出版社名3	テキスト
教科書定価3	テキスト
教科書ISBN3	テキスト
教科書備考3	テキスト
教科書著者名4	テキスト
教科書書名4	テキスト
教科書出版社名4	テキスト
教科書定価4	テキスト
教科書ISBN4	テキスト
教科書備考4	テキスト
教科書著者名5	テキスト
教科書書名5	テキスト
教科書出版社名5	テキスト
教科書定価5	テキスト
教科書ISBN5	テキスト
教科書備考5	テキスト
参考書著者名1	テキスト
参考書書名1	テキスト
参考書出版社名1	テキスト
参考書定価1	テキスト
参考書ISBN1	テキスト
参考書備考1	テキスト
参考書著者名2	テキスト
参考書書名2	テキスト
参考書出版社名2	テキスト
参考書定価2	テキスト
参考書ISBN2	テキスト
参考書備考2	テキスト
参考書著者名3	テキスト
参考書書名3	テキスト
参考書出版社名3	テキスト
参考書定価3	テキスト
参考書ISBN3	テキスト
参考書備考3	テキスト
参考書著者名4	テキスト
参考書書名4	テキスト
参考書出版社名4	テキスト
参考書定価4	テキスト
参考書ISBN4	テキスト
参考書備考4	テキスト
参考書著者名5	テキスト
参考書書名5	テキスト
参考書出版社名5	テキスト
参考書定価5	テキスト
参考書ISBN5	テキスト
参考書備考5	テキスト
当日用意すべきもの	テキスト
シラバス	テキスト
授業テーマ1	テキスト
授業テーマ2	テキスト
授業テーマ3	テキスト
授業テーマ4	テキスト
授業テーマ5	テキスト
授業テーマ6	テキスト
授業テーマ7	テキスト
授業テーマ8	テキスト
学生へのメッセージ	テキスト
成績評価	テキスト
成績評価その他	テキスト
その他の特記事項	テキスト
学習センター外会場	テキスト
学習センター外住所	テキスト
追加登録受入制限	テキスト
)

a = [["整数", "コード", "テキスト", "日付"], [:integer, :string, :text, :time]]
ah = Hash[a.transpose.flatten]

h = Hash[*fs]

ot = OneTable.find 8

index = 0
h.each do |key, value|
  ot.one_table_headers.create label: key,
    sysname: "h#{index}",
    kind: OneTableHeader::SYM2KIND_MAP[ah[value]],
    index: index
  index = index + 1
end
